IDENTIFICATION DIVISION.
PROGAM-ID. LEVEL-NUMBER,
ENVINRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 DATA.
02 NILAI PIC 9(2) VALUE 5.
02 NILAI PIC 9(2) VALUE 8.
02 i PIC 9.
02 j pic 9
SCREEN SECTION.
01 HAPUS-LAYAR.
49 BLANK SCREEN.
PROCEDURE DIVISION.
MULAI.
PERFORM <ETAK
VARYING i FROM 1 BY 1 UNTIL i > NILAIi
AFTER J FROM 1 BY 1 UNTIL J > 1.
SELESAI.
STOP RUN.
CETAK.
DISPLAY (,) i.
IF i = j DISPLAY SPACE.
SUBSTRACT 1 FROM NILAIi
